Repository: steinm/pxindex
Catalog: po/*.po
Languages: de

source: Usage: %s [OPTIONS] FILE
de: Aufruf: %s [OPTION] DATEI

source: Options:
de: Optionen:

source: -h, --help this usage information.
de: -h, --help diese Hilfe.

source: --version show version information.
de: --version zeige Programmversion.

source: -v, --verbose be more verbose.
de: -v, --verbose mehr Informationen anzeigen.

source: -d, --database-file=FILE read database from this file.
de: -d, --database-file=FILE lese Datenbank aus dieser Datei.

source: -s, --secindex=NUMBER create a secondary index from field NUMBER.
de: -s, --secindex=NUMMER erzeuge Sekundärindex für Feld NUMMER.

source: --use-gsf use gsf library to read input file.
de: --use-gsf benutze gsf-Bibliothek zum Lesen der Eingabedatei.

source: libpx uses librecode for recoding.
de: libpx benutzt librecode zum reencodieren.

source: libpx uses iconv for recoding.
de: libpx benutzt iconv zum reencodieren.

source: libpx has no support for recoding.
de: libpx unterstützt nicht das reencodieren.

source: libpx has been compiled for big endian architecture.
de: libpx wurde für Architekturen mit big endian übersetzt.

source: libpx has been compiled for little endian architecture.
de: libpx wurde für Architekturen mit little endian übersetzt.

source: libpx has gsf support: %s
de: libpx hat Unterstützung für die gsf-Bibliothek: %s

source: Yes
de: Ja

source: No
de: Nein

source: libpx has version: %d.%d.%d
de: libpx ist Version: %d.%d.%d

source: You must at least specify an output file and a database.
de: Sie müssen mindestes eine Ausgabedatei und Datenbank angegeben.

source: Cannot create an index if no database is given.
de: Kann den Index nicht erzeugen, wenn keine Datenbank angegeben wurde.

source: Could not create new paradox instance.
de: Konnte keine neue Paradox-Instanz erzeugen.

source: Could not open gsf input file.
de: Konnte Eingabedatei mit gsf-Bibliothek nicht öffnen.

source: Could not open input file.
de: Sie müssen mindestes eine Eingabedatei angegeben.

source: The database file has no primary key fields.
de: Die Datenbank hat keine Primärschlüsselfelder.

source: Could not get field definition of %i. secondary key field.
de: Konnte Felddefinition des %i. Sekundärschlüssels nicht erfragen.

source: Allocate memory for field definitions.
de: Alloziere Speicher für Felddefinitionen.

source: Could not allocate memory for field definitions.
de: Konnte Speicher für Felddefinitionen nicht allozieren.

source: Could not get field definition of %i. primary key field.
de: Konnte Felddefinition des %i. Primärschlüssels nicht erfragen.

source: Could not create secondary index file.
de: Konnte Datei für den Sekundärindex nicht anlegen.

source: Allocate memory for record data of database file.
de: Alloziere Speicher für Datensatz der Datenbank.

source: Could not allocate memory for record data of database file.
de: Konnte Speicher für einen Datensatz der Datenbank nicht allozieren.

source: Allocate memory for record data of index file.
de: Alloziere Speicher für Datensätze der Indexdatei.

source: Could not allocate memory for record data of index file.
de: Konnte Speicher für einen Datensatz der Indexdatei nicht allozieren.

source: Allocate memory for sorting records.
de: Alloziere Speicher zum Sortiern der Datensätze.

source: Allocate memory for field data of secondary index.
de: Konnte Speicher für Felddefinitionen des Sekundärindex nicht allozieren.

source: Allocate memory for field data of primary index.
de: Alloziere Speicher für Felddefinitionen des Primärschlüssels.

source: Could not get memory for field definitions.
de: Konnte Speicher für Felddefinitionen nicht allozieren.

source: Could not create primary index file.
de: Konnte Datei für den Primärindex nicht anlegen.
